using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/* Задание 1.  Вариант 1 автомобиль.- Разработать один из классов, в соответствии с полученным вариантом.//- Реализовать не менее пяти закрытых полей (различных типов), представляющих//основные характеристики рассматриваемого класса. - Создать не менее трех методов управления классом и методы доступа к его закрытым полям.//- Создать метод, в который передаются аргументы по ссылке. //- Создать не менее двух статических полей  (различных типов), представляющих общиехарактеристики объектов данного класса. //- Обязательным требованием является реализация нескольких перегруженных конструкторов,аргументы которых определяются студентом, исходя из специфики реализуемого класса,а также реализация конструктора по умолчанию. //- Создать статический конструктор. //- Создать массив (не менее 5 элементов) объектов  созданного класса. //- Создать дополнительный метод для данного класса в другом файле,используя ключевое слово partial. // */

namespace ProjectsCSharp
{
    public class HW_Class
    {
        public HW_Class()
        {
            Console.WriteLine("Hello!");
            Console.ReadKey();
        }
    }
}
